{"Question": "Dựa trên dữ liệu: Latitude=12.71667, Longitude=107.98333, Region='Tây Nguyên', Year=2023, Season='Xuân', Crop Type='Cà phê', Soil Type='Đất đỏ bazan', NDVI=[0.364], LST=[300.05], ET=[3.2], MSI=[0.45]. Hãy đánh giá sức khỏe cây trồng, dự đoán năng suất mùa vụ và đưa ra khuyến nghị xử lý.", "Complex_CoT": "Bước 1: NDVI 0.364 cho thấy cây trồng có sức sống trung bình. Bước 2: LST 300.05K ở mức tương đối cao, có thể gây stress nhiệt. Bước 3: ET 3.2 cho thấy mức bốc hơi trung bình. Bước 4: MSI 0.45 phản ánh mức độ căng thẳng nước trung bình. => Cây trồng có sức khỏe trung bình, cần theo dõi thêm điều kiện môi trường.", "Response": "Sức khỏe: Trung bình; Năng suất dự đoán ổn định; Khuyến nghị: Duy trì tưới nước hợp lý, theo dõi diễn biến thời tiết."}
{"Question": "Dựa trên dữ liệu: Latitude=12.71667, Longitude=107.98333, Region='Tây Nguyên', Year=2023, Season='Xuân', Crop Type='Cà phê', Soil Type='Đất đỏ bazan', NDVI=[0.380], LST=[305.89], ET=[3.5], MSI=[0.50]. Hãy đánh giá sức khỏe cây trồng, dự đoán năng suất mùa vụ và đưa ra khuyến nghị xử lý.", "Complex_CoT": "Bước 1: NDVI 0.380 cho thấy cây trồng có sức sống khá tốt. Bước 2: LST 305.89K tăng so với trước, có thể làm tăng stress nhiệt. Bước 3: ET 3.5 cho thấy mức bốc hơi ổn định. Bước 4: MSI 0.50 phản ánh tình trạng căng thẳng nước tăng nhẹ. => Cây trồng có sức khỏe khá, nhưng cần chú ý stress nhiệt.", "Response": "Sức khỏe: Khá tốt; Năng suất dự đoán ổn định; Khuyến nghị: Tưới bổ sung vào các ngày nắng nóng, tăng cường che bóng."}
{"Question": "Dựa trên dữ liệu: Latitude=12.71667, Longitude=107.98333, Region='Tây Nguyên', Year=2023, Season='Xuân', Crop Type='Cà phê', Soil Type='Đất đỏ bazan', NDVI=[0.360], LST=[290.70], ET=[3.1], MSI=[0.48]. Hãy đánh giá sức khỏe cây trồng, dự đoán năng suất mùa vụ và đưa ra khuyến nghị xử lý.", "Complex_CoT": "Bước 1: NDVI 0.360 cho thấy cây trồng duy trì sức sống ổn định. Bước 2: LST 290.70K giảm so với trước, giảm nguy cơ stress nhiệt. Bước 3: ET 3.1 giảm nhẹ, có thể liên quan đến điều kiện đất hoặc thời tiết. Bước 4: MSI 0.48 phản ánh mức độ căng thẳng nước ổn định. => Cây trồng có sức khỏe tốt, nhưng cần theo dõi lượng nước tưới.", "Response": "Sức khỏe: Ổn định; Năng suất dự đoán duy trì; Khuyến nghị: Tiếp tục tưới nước hợp lý, kiểm tra độ ẩm đất."}
{"Question": "Dựa trên dữ liệu: Latitude=12.71667, Longitude=107.98333, Region='Tây Nguyên', Year=2023, Season='Xuân', Crop Type='Cà phê', Soil Type='Đất đỏ bazan', NDVI=[0.282], LST=[312.86], ET=[2.8], MSI=[0.55]. Hãy đánh giá sức khỏe cây trồng, dự đoán năng suất mùa vụ và đưa ra khuyến nghị xử lý.", "Complex_CoT": "Bước 1: NDVI 0.282 cho thấy cây trồng suy giảm sức sống đáng kể. Bước 2: LST 312.86K rất cao, gây stress nhiệt nghiêm trọng. Bước 3: ET 2.8 thấp hơn mức trung bình, cho thấy tình trạng hạn hán. Bước 4: MSI 0.55 tăng cao, phản ánh mức căng thẳng nước lớn. => Cây trồng chịu áp lực nhiệt và thiếu nước nghiêm trọng, cần can thiệp ngay.", "Response": "Sức khỏe: Suy giảm mạnh; Năng suất dự đoán giảm 20-30%; Khuyến nghị: Tưới bổ sung 7mm/ngày, che bóng và cải thiện độ ẩm đất."}
{"Question": "Dựa trên dữ liệu: Latitude=12.71667, Longitude=107.98333, Region='Tây Nguyên', Year=2023, Season='Xuân', Crop Type='Cà phê', Soil Type='Đất đỏ bazan', NDVI=[0.229], LST=[289.92], ET=[2.6], MSI=[0.60]. Hãy đánh giá sức khỏe cây trồng, dự đoán năng suất mùa vụ và đưa ra khuyến nghị xử lý.", "Complex_CoT": "Bước 1: NDVI 0.229 rất thấp, phản ánh tình trạng yếu của cây trồng. Bước 2: LST 289.92K giảm nhưng không đủ để cải thiện tình trạng cây. Bước 3: ET 2.6 tiếp tục giảm, thể hiện mức độ khô hạn nặng. Bước 4: MSI 0.60 cho thấy cây trồng đang chịu stress nước nghiêm trọng. => Cây trồng có nguy cơ mất trắng nếu không can thiệp kịp thời.", "Response": "Sức khỏe: Nguy cấp; Năng suất dự đoán giảm trên 30%; Khuyến nghị: Tưới cấp cứu, bổ sung chất hữu cơ giữ ẩm, hạn chế thoát hơi nước."}
{"Question": "Dựa trên dữ liệu: Latitude=12.71667, Longitude=107.98333, Region='Tây Nguyên', Year=2023, Season='Xuân', Crop Type='Cà phê', Soil Type='Đất đỏ bazan', NDVI=[0.218], LST=[309.60], ET=[2.4], MSI=[0.62]. Hãy đánh giá sức khỏe cây trồng, dự đoán năng suất mùa vụ và đưa ra khuyến nghị xử lý.", "Complex_CoT": "Bước 1: NDVI 0.218 tiếp tục thấp, cây trồng suy yếu. Bước 2: LST 309.60K ở mức cao, gây áp lực nhiệt. Bước 3: ET 2.4 xuống rất thấp, phản ánh thiếu hụt nước trầm trọng. Bước 4: MSI 0.62 cho thấy mức căng thẳng nước rất lớn. => Cây cà phê bị hạn nặng, cần biện pháp khẩn cấp để cứu mùa vụ.", "Response": "Sức khỏe: Cực kỳ nguy hiểm; Năng suất dự đoán giảm mạnh trên 40%; Khuyến nghị: Áp dụng tưới tiết kiệm nước, che phủ gốc cây, sử dụng vật liệu giữ ẩm."}
{"Question": "Dựa trên dữ liệu: Latitude=12.71667, Longitude=107.98333, Region='Tây Nguyên', Year=2023, Season='Xuân', Crop Type='Cà phê', Soil Type='Đất đỏ bazan', NDVI=[0.194], LST=[282.13], ET=[2.1], MSI=[0.65]. Hãy đánh giá sức khỏe cây trồng, dự đoán năng suất mùa vụ và đưa ra khuyến nghị xử lý.", "Complex_CoT": "Bước 1: NDVI 0.194 là mức rất thấp, phản ánh cây gần như kiệt sức. Bước 2: LST 282.13K giảm mạnh, nhưng do cây đã suy yếu, không có lợi. Bước 3: ET 2.1 cực thấp, cho thấy cây không thể hấp thụ nước đầy đủ. Bước 4: MSI 0.65 cao nhất trong chuỗi dữ liệu, báo hiệu cây bị stress nước cực độ. => Nguy cơ chết cây rất cao nếu không có biện pháp ngay lập tức.", "Response": "Sức khỏe: Cực kỳ xấu; Năng suất dự đoán giảm trên 50%; Khuyến nghị: Tưới cấp tốc, giảm tán lá để hạn chế thoát hơi nước, bổ sung chất dinh dưỡng."}
{"Question": "Dựa trên dữ liệu: Latitude=12.71667, Longitude=107.98333, Region='Tây Nguyên', Year=2023, Season='Xuân', Crop Type='Cà phê', Soil Type='Đất đỏ bazan', NDVI=[0.390], LST=[304.02], ET=[3.3], MSI=[0.42]. Hãy đánh giá sức khỏe cây trồng, dự đoán năng suất mùa vụ và đưa ra khuyến nghị xử lý.", "Complex_CoT": "Bước 1: NDVI 0.390 tăng trở lại, cho thấy cây đang phục hồi. Bước 2: LST 304.02K vẫn cao nhưng không đến mức gây stress nghiêm trọng. Bước 3: ET 3.3 cải thiện đáng kể, phản ánh cây hấp thụ nước tốt hơn. Bước 4: MSI 0.42 giảm mạnh, chứng tỏ mức độ căng thẳng nước đã giảm. => Cây trồng có dấu hiệu hồi phục, cần tiếp tục hỗ trợ để tăng trưởng ổn định.", "Response": "Sức khỏe: Phục hồi; Năng suất dự đoán cải thiện 10-15%; Khuyến nghị: Tiếp tục tưới bổ sung, cung cấp phân bón hữu cơ, duy trì độ che phủ đất."}

  