{"Question": "Dựa trên dữ liệu: Latitude=12.71667, Longitude=107.98333, Region='Tây Nguyên', Year=2023, Season='Xuân', Crop Type='Cà phê', Soil Type='Đất đỏ bazan', NDVI=[0.364], LST=[300.05], ET=[3.2], MSI=[0.45]. Hãy đánh giá sức khỏe cây trồng, dự đoán năng suất mùa vụ và đưa ra khuyến nghị xử lý.", "Complex_CoT": "Bước 1: NDVI 0.364 cho thấy cây trồng có sức sống trung bình. Bước 2: LST 300.05K ở mức tương đối cao, có thể gây stress nhiệt. Bước 3: ET 3.2 cho thấy mức bốc hơi trung bình. Bước 4: MSI 0.45 phản ánh mức độ căng thẳng nước trung bình. => Cây trồng có sức khỏe trung bình, cần theo dõi thêm điều kiện môi trường.", "Response": "Sức khỏe: Trung bình; Năng suất dự đoán ổn định; Khuyến nghị: Duy trì tưới nước hợp lý, theo dõi diễn biến thời tiết."}
{"Question": "Dựa trên dữ liệu: Latitude=12.71667, Longitude=107.98333, Region='Tây Nguyên', Year=2023, Season='Xuân', Crop Type='Cà phê', Soil Type='Đất đỏ bazan', NDVI=[0.380], LST=[305.89], ET=[3.5], MSI=[0.50]. Hãy đánh giá sức khỏe cây trồng, dự đoán năng suất mùa vụ và đưa ra khuyến nghị xử lý.", "Complex_CoT": "Bước 1: NDVI 0.380 cho thấy cây trồng có sức sống khá tốt. Bước 2: LST 305.89K tăng so với trước, có thể làm tăng stress nhiệt. Bước 3: ET 3.5 cho thấy mức bốc hơi ổn định. Bước 4: MSI 0.50 phản ánh tình trạng căng thẳng nước tăng nhẹ. => Cây trồng có sức khỏe khá, nhưng cần chú ý stress nhiệt.", "Response": "Sức khỏe: Khá tốt; Năng suất dự đoán ổn định; Khuyến nghị: Tưới bổ sung vào các ngày nắng nóng, tăng cường che bóng."}
{"Question": "Dựa trên dữ liệu: Latitude=12.71667, Longitude=107.98333, Region='Tây Nguyên', Year=2023, Season='Xuân', Crop Type='Cà phê', Soil Type='Đất đỏ bazan', NDVI=[0.360], LST=[290.70], ET=[3.1], MSI=[0.48]. Hãy đánh giá sức khỏe cây trồng, dự đoán năng suất mùa vụ và đưa ra khuyến nghị xử lý.", "Complex_CoT": "Bước 1: NDVI 0.360 cho thấy cây trồng duy trì sức sống ổn định. Bước 2: LST 290.70K giảm so với trước, giảm nguy cơ stress nhiệt. Bước 3: ET 3.1 giảm nhẹ, có thể liên quan đến điều kiện đất hoặc thời tiết. Bước 4: MSI 0.48 phản ánh mức độ căng thẳng nước ổn định. => Cây trồng có sức khỏe tốt, nhưng cần theo dõi lượng nước tưới.", "Response": "Sức khỏe: Ổn định; Năng suất dự đoán duy trì; Khuyến nghị: Tiếp tục tưới nước hợp lý, kiểm tra độ ẩm đất."}